/**************************************************************/

let str = "Hello";                          // 큰따옴표
let str2 = 'Single quotes are ok too';      // 작은따옴표
let phrase = `can embed another ${str}`;    // 역 따옴표(백틱, backtick)

/**************************************************************/

let name = "John";

// 변수를 문자열 중간에 삽입
alert( `Hello, ${name}!` ); // Hello, John!

// 표현식을 문자열 중간에 삽입
alert( `the result is ${1 + 2}` ); // the result is 3

/**************************************************************/

alert( "the result is ${1 + 2}" ); // the result is ${1 + 2} (큰따옴표는 확장 기능을 지원하지 않습니다.)

/**************************************************************/