/*------------------------------------------------*/

alert( "6" / "2" ); // 3, 문자열이 숫자형으로 자동변환된 후 연산이 수행

/*------------------------------------------------*/

let str = '123';
alert(typeof str);  // string

let num = Number(str)   // 문자열 '123'이 숫자 123으로 변환
alert(typeof num);  // number

/*------------------------------------------------*/

let age = Number('임의의 문자열 123');
alert(age); // NaN, 형 변환 실패

/*------------------------------------------------*/

alert( Number("   123   ") ); // 123
alert( Number("123z") );      // NaN ("z"를 숫자로 변환하는 데 실패함)
alert( Number(true) );        // 1
alert( Number(false) );       // 0

/*------------------------------------------------*/