/*--------------------------------------------------------*/

let a = prompt("덧셈할 첫 번째 숫자를 입력해주세요.", 1);
let b = prompt("덧셈할 두 번째 숫자를 입력해주세요.", 2);

alert(Number(a + b)); // 12

/*--------------------------------------------------------*/

let c = prompt("덧셈할 첫 번째 숫자를 입력해주세요.", 1);
let d = prompt("덧셈할 두 번째 숫자를 입력해주세요.", 2);

alert(c + d); // 3

/*--------------------------------------------------------*/

let e = prompt("덧셈할 첫 번째 숫자를 입력해주세요.", 1);
let f = prompt("덧셈할 두 번째 숫자를 입력해주세요.", 2);

alert(+e + +f); // 3

/*--------------------------------------------------------*/