let counter1 = 2;
counter1++;          // counter = counter + 1과 동일하게 동작
alert( counter1 );   // 3

/*------------------------------------------------*/

let counter2 = 1;
let a = ++counter2; // (*)

alert(a); // 2

/*------------------------------------------------*/

let counter3 = 1;
let b = counter3++; // (*) ++counter를 counter++로 바꿈

alert(b); // 1

/*------------------------------------------------*/

let counter4 = 0;
counter4++;
++counter4;
alert( counter ); // 2, 위 두 라인은 동일한 연산을 수행

/*------------------------------------------------*/

let counter5 = 0;
alert( ++counter5 ); // 1

/*------------------------------------------------*/

let counter6 = 0;
alert( counter6++ ); // 0

/*------------------------------------------------*/

let counter7 = 1;
alert( 2 * ++counter7 ); // 4

/*------------------------------------------------*/

let counter8 = 1;
alert( 2 * counter8++ ); // counter++는 '기존'값을 반환하기 때문에 2가 출력

/*------------------------------------------------*/

let counter9 = 1;
alert( 2 * counter9 );
counter9++;

/*------------------------------------------------*/

let counter10 = 1;
alert( 2 * ++counter ); // 4

let counter11 = 1;
alert( 2 * counter++ ); // counter++는 '기존'값을 반환하기 때문에 2가 출력

/*------------------------------------------------*/

let counter = 1;
alert( 2 * counter );
counter++;

/*------------------------------------------------*/